
/* Properties that, if returned by CGImageSourceGetProperties or 
 * CGImageSourceGetPropertiesAtIndex, contain a dictionary of file-format 
 * or metadata-format specific key-values. */

"{TIFF}"			= "TIFF-Eigenschaften";
"{GIF}"				= "GIF-Eigenschaften";
"{JFIF}"			= "JFIF-Eigenschaften";
"{Exif}"			= "Exif-Eigenschaften";
"{PNG}"				= "PNG-Eigenschaften";
"{IPTC}"			= "IPTC-Eigenschaften";
"{GPS}"				= "GPS-Eigenschaften";
"{Raw}"				= "Raw-Eigenschaften";
"{8BIM}"			= "Photoshop-Eigenschaften";

/** Properties which may be returned by "CGImageSourceGetProperties".  The
 ** values apply to the container in general but not necessarily to any
 ** individual image that it contains. **/

"FileSize"			= "Dateigröße";

/** Properties which may be returned by "CGImageSourceGetPropertiesAtIndex".
 ** The values apply to a single image of an image source file. **/

"DPIHeight"			= "DPI (Höhe)";
"DPIWidth"			= "DPI (Breite)";
"PixelHeight"			= "Pixel (Höhe)";
"PixelWidth"			= "Pixel (Breite)";
"Depth"				= "Farbtiefe";
"Orientation"			= "Ausrichtung";
"IsFloat"			= "Float";
"IsIndexed"			= "Indiziert";
"HasAlpha"			= "Alpha-Kanal";
"ColorModel"			= "Farbmodell";
"ProfileName"			= "Profilname";

/* Possible values for type identifier */

"public.tiff"			= "TIFF";
"public.fax"			= "Fax";
"public.jpeg"			= "JPEG";
"public.jpeg-2000"		= "JPEG-2000";
"public.png"			= "PNG";
"public.radiance"		= "Radiance";
"public.xbitmap-image"          = "X-Bitmap";

"com.apple.pict"		= "PICT";
"com.apple.quicktime-image"	= "QuickTime";
"com.apple.macpaint-image"      = "MacPaint";
"com.apple.icns"		= "ICNS";

"com.adobe.pdf"			= "PDF";
"com.adobe.photoshop-image"	= "Photoshop";

"com.compuserve.gif"		= "GIF";
"com.ilm.openexr-image"		= "OpenEXR";
"com.microsoft.ico"		= "ICO";
"com.microsoft.bmp"		= "BMP";
"com.sgi.sgi-image"		= "SGI";
"com.truevision.tga-image"	= "TGA";
"com.kodak.flashpix-image"      = "Flashpix";

"public.camera-raw-image"       = "Kamera-Raw";
"com.adobe.raw-image"		= "Adobe Raw";
"com.canon.crw-raw-image"       = "Canon CRW Raw";
"com.canon.cr2-raw-image"       = "Canon CR2 Raw";
"com.canon.tif-raw-image"       = "Canon TIF Raw";
"com.nikon.raw-image"		= "Nikon Raw";
"com.canon.raw-image"		= "Canon Raw";
"com.olympus.raw-image"		= "Olympus Raw";
"com.fuji.raw-image"		= "Fuji Raw";
"com.sony.raw-image"		= "Sony Raw";
"com.konicaminolta.raw-image"   = "Konica Minolta Raw";
"com.kodak.raw-image"		= "Kodak Raw";

/* Possible values for kCGImagePropertyColorModel property */

"RGB"				= "RGB";
"Gray"				= "Graustufen";
"CMYK"				= "CMYK";
"Lab"				= "Lab";

/* Possible keys for kCGImagePropertyTIFFDictionary */

"Compression"			= "Komprimierung";
"PhotometricInterpretation"	= "Fotometrische Interpretation";
"DocumentName"			= "Dokumentname";
"ImageDescription"		= "Bildbeschreibung";
"Make"				= "Hersteller";
"Model"				= "Modell";
/*"Orientation"			= "Orientation";*/
"XResolution"			= "X-Auflösung";
"YResolution"			= "Y-Auflösung";
"ResolutionUnit"		= "Auflösungseinheit";
"Software"			= "Software";
"TransferFunction"		= "Übertragungsfunktion";
"DateTime"			= "Datum/Uhrzeit";
"Artist"			= "Fotograf";
"HostComputer"			= "Host-Computer";
"Copyright"			= "Copyright";
"WhitePoint"			= "Farbtemperatur";
"PrimaryChromaticities"		= "Haupt-Phosphor-Werte";
"sRGBIntent"			= "sRGB-Anpassungsart";
"Chromaticities"		= "Phosphor-Werte";

/* Possible keys for kCGImagePropertyJFIFDictionary */

"JFIFVersion"			= "JFIF-Version";
"XDensity"			= "X-Dichte";
"YDensity"			= "Y-Dichte";
"DensityUnit"			= "Einheit für Dichte";

/* Possible keys for kCGImagePropertyExifDictionary */

"ExposureTime"			= "Belichtungszeit";
"FNumber"			= "Blendenwert";
"ExposureProgram"		= "Belichtungsprogramm";
"SpectralSensitivity"		= "Spektrale Empfindlichkeit";
"ISOSpeedRatings"		= "ISO-Geschwindigkeit";
"OECF"				= "OECF";
"ExifVersion"			= "Exif-Version";
"DateTimeOriginal"		= "Datum/Uhrzeit, Original";
"DateTimeDigitized"		= "Datum/Uhrzeit, digital.";
"ComponentsConfiguration"       = "Konfiguration der Komponenten";
"CompressedBitsPerPixel"	= "Komprimierte Bit pro Pixel";
"ShutterSpeedValue"		= "Verschlussgeschwindigkeit";
"ApertureValue"			= "Blendenöffnungswert";
"BrightnessValue"		= "Helligkeitswert";
"ExposureBiasValue"		= "Wert der Belichtungskorrektur";
"MaxApertureValue"		= "Maximale Blendenöffnung";
"SubjectDistance"		= "Abstand des Betreffs";
"MeteringMode"			= "Messmethode";
"LightSource"			= "Lichtquelle";
"Flash"				= "Blitz";
"FocalLength"			= "Brennweite";
"SubjectArea"			= "Betreffbereich";
"MakerNote"			= "Hinweis des Herstellers";
"UserComment"			= "Kommentar des Benutzers";
"SubsecTime"			= "Subsec Zeit";
"SubsecTimeOrginal"		= "Subsec TimeOrginal";
"SubsecTimeDigitized"		= "Subsec TimeDigitized";
"FlashPixVersion"		= "FlashPix-Version";
"ColorSpace"			= "Farbraum";
"PixelXDimension"		= "Pixel X-Abmessung";
"PixelYDimension"		= "Pixel Y-Abmessung";
"RelatedSoundFile"		= "Zugehörige Audiodatei";
"FlashEnergy"			= "Blitzleistung";
"SpatialFrequencyResponse"      = "Antwort der räumlichen Frequenz";
"FocalPlaneXResolution"		= "Bildebene X-Auflösung";
"FocalPlaneYResolution"		= "Bildebene Y-Auflösung";
"FocalPlaneResolutionUnit"      = "Einheit für die Bildebenen-Auflösung";
"SubjectLocation"		= "Ort des Betreffs";
"ExposureIndex"			= "Belichtungsindex";
"SensingMethod"			= "Abtastmethode";
"FileSource"			= "Dateiquelle";
"SceneType"			= "Szenentyp";
"CFAPattern"			= "CFA-Schema";
"CustomRendered"		= "Selbst gerendert";
"ExposureMode"			= "Belichtungsmodus";
"WhiteBalance"			= "Weißabgleich";
"DigitalZoomRatio"		= "Verhältnis des digitalen Zooms";
"FocalLenIn35mmFilm"		= "Brennweite bei 35 mm-Filmen";
"SceneCaptureType"		= "Typ der Szenenaufnahme";
"GainControl"			= "Steuerung übernehmen";
"Contrast"			= "Kontrast";
"Saturation"			= "Sättigung";
"Sharpness"			= "Schärfe";
"DeviceSettingDescription"      = "Beschreibung der Geräteeinstellung";
"SubjectDistRange"		= "Bereich für Abstand des Betreffs";
"ImageUniqueID"			= "Eindeutige ID des Bilds";
/*"Gamma"			= "Gamma";*/

/* Possible keys for kCGImagePropertyGIFDictionary */

"LoopCount"			= "Anzahl der Schleifen";
"DelayTime"			= "Verzögerungszeit";
"ImageColorMap"			= "Farbkarte des Bilds";
"HasGlobalColorMap"		= "Hat eine globale Farbkarte";

/* Possible keys for kCGImagePropertyPNGDictionary */

"Gamma"				= "Gamma";
"InterlaceType"			= "Interlace-Typ";
"XPixelsPerMeter"		= "X Pixel pro Meter";
"YPixelsPerMeter"		= "Y Pixel pro Meter";

/* Possible keys for kCGImagePropertyGPSDictionary */

"GPSVersion"			= "GPS-Version";
"LatitudeRef"			= "Referenz für Breitengrad";
"Latitude"			= "Breitengrad";
"LongitudeRef"			= "Referenz für Längengrad";
"Longitude"			= "Längengrad";
"AltitudeRef"			= "Höhenreferenz";
"Altitude"			= "Höhe";
"TimeStamp"			= "Zeitmarke";
"Satellites"			= "Satelliten";
"Status"			= "Status";
"MeasureMode"			= "Messmodus";
"DOP"				= "Grad der Präzision";
"SpeedRef"			= "Referenz für Geschwindigkeit";
"Speed"				= "Tempo";
"TrackRef"			= "Spurreferenz";
"Track"				= "Spur";
"ImgDirectionRef"		= "Referenz der Bildrichtung";
"ImgDirection"			= "Bildrichtung";
"MapDatum"			= "Datum zuweisen";
"DestLatitudeRef"		= "Referenz für Breitengrad des Ziels";
"DestLatitude"			= "Breitengrad des Ziels";
"DestLongitudeRef"		= "Referenz für Längengrad des Ziels";
"DestLongitude"			= "Längengrad des Ziels";
"DestBearingRef"		= "Referenz für Lage des Ziels";
"DestBearing"			= "Lage des Ziels";
"DestDistanceRef"		= "Referenz für Entfernung des Ziels";
"DestDistance"			= "Entfernung des Ziels";
"ProcessingMethod"		= "Bearbeitungsmethode";
"AreaInformation"		= "Flächeninformation";
"DateStamp"			= "Datumstempel";
"Differental"			= "Differenz";

/* Possible keys for kCGImagePropertyIPTCDictionary */

"ObjectTypeReference"		= "Referenz des Objekttyps";
"ObjectAttributeReference"	= "Attributreferenz des Objekts";
"ObjectName"			= "Objektname";
"EditStatus"			= "Status bearbeiten";
"EditorialUpdate"		= "Redaktionelles Update";
"Urgency"			= "Dringlichkeit";
"SubjectReference"		= "Referenz des Betreffs";
"Category"			= "Kategorie";
"SupplementalCategory"		= "Ergänzende Kategorie";
"FixtureIdentifier"		= "Identifizierung der Vorrichtung";
"Keywords"			= "Schlüsselwörter";
"ContentLocationCode"		= "Code des Inhalts-Ortes";
"ContentLocationName"		= "Name des Inhalts-Ortes";
"ReleaseDate"			= "Erscheinungsdatum";
"ReleaseTime"			= "Erscheinungszeit";
"ExpirationDate"		= "Ablaufdatum";
"ExpirationTime"		= "Ablaufzeit";
"SpecialInstructions"		= "Spezielle Anweisungen";
"ActionAdvised"			= "Angekündigte Aktion";
"ReferenceService"		= "Referenzdienst";
"ReferenceDate"			= "Referenzdatum";
"ReferenceNumber"		= "Referenznummer";
"DateCreated"			= "Erstellungsdatum";
"TimeCreated"			= "Erstellungszeit";
"DigitalCreationDate"		= "Digitales Erstellungsdatum";
"DigitalCreationTime"		= "Digitale Erstellungszeit";
"OriginatingProgram"		= "Herkunftsprogramm";
"ProgramVersion"		= "Programmversion";
"ObjectCycle"			= "Objektzyklus";
"Byline"			= "Nebenlinie";
"BylineTitle"			= "Titel der Nebenlinie";
"City"				= "Stadt";
"SubLocation"			= "Unterort";
"Province/State"		= "Bundesland";
"Country/PrimaryLocationCode"	= "Land/Code des Hauptorts";
"Country/PrimaryLocationName"	= "Land/Name des Hauptorts";
"OriginalTransmissionReference"	= "Referenz der Originalübertragung";
"Headline"			= "Schlagzeile";
"Credit"			= "Guthaben";
"Source"			= "Original";
"CopyrightNotice"		= "Copyright-Hinweis";
"Contact"			= "Kontakt";
"Caption/Abstract"		= "Überschrift / Abstrakt";
"Writer/Editor"			= "Verfasser/Editor";
"ImageType"			= "Bildart";
"ImageOrientation"		= "Bildausrichtung";
"LanguageIdentifier"		= "Sprachidentifizierung";

/* Possible keys for kCGImageProperty8BIMDictionary */

"LayerNames"			= "Namen der Ebenen";